Model: "model_25"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_26 (InputLayer)       [(None, 28, 28)]          0         
                                                                 
 flatten_25 (Flatten)        (None, 784)               0         
                                                                 
 dense_70 (Dense)            (None, 392)               307720    
                                                                 
 dense_71 (Dense)            (None, 784)               308112    
                                                                 
 reshape_25 (Reshape)        (None, 28, 28)            0         
                                                                 
=================================================================
Total params: 615,832
Trainable params: 615,832
Non-trainable params: 0
_________________________________________________________________
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0986 - val_loss: 0.0666
Model: "model_26"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_27 (InputLayer)       [(None, 28, 28)]          0         
                                                                 
 flatten_26 (Flatten)        (None, 784)               0         
                                                                 
 dense_72 (Dense)            (None, 392)               307720    
                                                                 
 dense_73 (Dense)            (None, 784)               308112    
                                                                 
 reshape_26 (Reshape)        (None, 28, 28)            0         
                                                                 
=================================================================
Total params: 615,832
Trainable params: 615,832
Non-trainable params: 0
_________________________________________________________________
Epoch 1/5
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0978 - val_loss: 0.0667
Epoch 2/5
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0630 - val_loss: 0.0592
Epoch 3/5
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0562 - val_loss: 0.0527
Epoch 4/5
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0503 - val_loss: 0.0473
Epoch 5/5
1875/1875 [==============================] - 10s 6ms/step - loss: 0.0455 - val_loss: 0.0430
Model: "model_27"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_28 (InputLayer)       [(None, 28, 28)]          0         
                                                                 
 flatten_27 (Flatten)        (None, 784)               0         
                                                                 
 dense_74 (Dense)            (None, 392)               307720    
                                                                 
 dense_75 (Dense)            (None, 784)               308112    
                                                                 
 reshape_27 (Reshape)        (None, 28, 28)            0         
                                                                 
=================================================================
Total params: 615,832
Trainable params: 615,832
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0990 - val_loss: 0.0666
Epoch 2/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0629 - val_loss: 0.0592
Epoch 3/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0562 - val_loss: 0.0528
Epoch 4/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0504 - val_loss: 0.0475
Epoch 5/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0457 - val_loss: 0.0433
Epoch 6/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0420 - val_loss: 0.0399
Epoch 7/10
1875/1875 [==============================] - 10s 6ms/step - loss: 0.0389 - val_loss: 0.0371
Epoch 8/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0363 - val_loss: 0.0348
Epoch 9/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0342 - val_loss: 0.0328
Epoch 10/10
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0323 - val_loss: 0.0310
Model: "model_28"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_29 (InputLayer)       [(None, 28, 28)]          0         
                                                                 
 flatten_28 (Flatten)        (None, 784)               0         
                                                                 
 dense_76 (Dense)            (None, 392)               307720    
                                                                 
 dense_77 (Dense)            (None, 784)               308112    
                                                                 
 reshape_28 (Reshape)        (None, 28, 28)            0         
                                                                 
=================================================================
Total params: 615,832
Trainable params: 615,832
Non-trainable params: 0
_________________________________________________________________
Epoch 1/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0976 - val_loss: 0.0667
Epoch 2/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0630 - val_loss: 0.0592
Epoch 3/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0562 - val_loss: 0.0528
Epoch 4/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0504 - val_loss: 0.0474
Epoch 5/20
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0456 - val_loss: 0.0431
Epoch 6/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0418 - val_loss: 0.0397
Epoch 7/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0388 - val_loss: 0.0369
Epoch 8/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0362 - val_loss: 0.0346
Epoch 9/20
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0341 - val_loss: 0.0327
Epoch 10/20
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0323 - val_loss: 0.0310
Epoch 11/20
1875/1875 [==============================] - 12s 7ms/step - loss: 0.0307 - val_loss: 0.0295
Epoch 12/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0293 - val_loss: 0.0281
Epoch 13/20
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0280 - val_loss: 0.0269
Epoch 14/20
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0269 - val_loss: 0.0258
Epoch 15/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0258 - val_loss: 0.0248
Epoch 16/20
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0249 - val_loss: 0.0239
Epoch 17/20
1875/1875 [==============================] - 13s 7ms/step - loss: 0.0240 - val_loss: 0.0231
Epoch 18/20
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0232 - val_loss: 0.0223
Epoch 19/20
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0224 - val_loss: 0.0216
Epoch 20/20
1875/1875 [==============================] - 14s 8ms/step - loss: 0.0217 - val_loss: 0.0209
Model: "model_29"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_30 (InputLayer)       [(None, 28, 28)]          0         
                                                                 
 flatten_29 (Flatten)        (None, 784)               0         
                                                                 
 dense_78 (Dense)            (None, 392)               307720    
                                                                 
 dense_79 (Dense)            (None, 784)               308112    
                                                                 
 reshape_29 (Reshape)        (None, 28, 28)            0         
                                                                 
=================================================================
Total params: 615,832
Trainable params: 615,832
Non-trainable params: 0
_________________________________________________________________
Epoch 1/50
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0967 - val_loss: 0.0667
Epoch 2/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0630 - val_loss: 0.0593
Epoch 3/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0563 - val_loss: 0.0528
Epoch 4/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0503 - val_loss: 0.0473
Epoch 5/50
1875/1875 [==============================] - 10s 5ms/step - loss: 0.0455 - val_loss: 0.0429
Epoch 6/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0416 - val_loss: 0.0395
Epoch 7/50
1875/1875 [==============================] - 12s 7ms/step - loss: 0.0385 - val_loss: 0.0367
Epoch 8/50
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0360 - val_loss: 0.0343
Epoch 9/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0338 - val_loss: 0.0323
Epoch 10/50
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0319 - val_loss: 0.0306
Epoch 11/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0303 - val_loss: 0.0291
Epoch 12/50
1875/1875 [==============================] - 12s 6ms/step - loss: 0.0289 - val_loss: 0.0277
Epoch 13/50
1875/1875 [==============================] - 12s 7ms/step - loss: 0.0276 - val_loss: 0.0265
Epoch 14/50
1875/1875 [==============================] - 10s 5ms/step - loss: 0.0265 - val_loss: 0.0255
Epoch 15/50
1875/1875 [==============================] - 10s 5ms/step - loss: 0.0255 - val_loss: 0.0245
Epoch 16/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0245 - val_loss: 0.0236
Epoch 17/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0237 - val_loss: 0.0228
Epoch 18/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0229 - val_loss: 0.0220
Epoch 19/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0222 - val_loss: 0.0213
Epoch 20/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0215 - val_loss: 0.0207
Epoch 21/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0209 - val_loss: 0.0201
Epoch 22/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0203 - val_loss: 0.0195
Epoch 23/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0197 - val_loss: 0.0190
Epoch 24/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0192 - val_loss: 0.0185
Epoch 25/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0187 - val_loss: 0.0180
Epoch 26/50
1875/1875 [==============================] - 8s 5ms/step - loss: 0.0183 - val_loss: 0.0176
Epoch 27/50
1875/1875 [==============================] - 10s 5ms/step - loss: 0.0178 - val_loss: 0.0171
Epoch 28/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0174 - val_loss: 0.0168
Epoch 29/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0170 - val_loss: 0.0164
Epoch 30/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0167 - val_loss: 0.0160
Epoch 31/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0163 - val_loss: 0.0157
Epoch 32/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0160 - val_loss: 0.0154
Epoch 33/50
1875/1875 [==============================] - 11s 6ms/step - loss: 0.0157 - val_loss: 0.0151
Epoch 34/50
1875/1875 [==============================] - 10s 5ms/step - loss: 0.0154 - val_loss: 0.0148
Epoch 35/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0151 - val_loss: 0.0145
Epoch 36/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0148 - val_loss: 0.0142
Epoch 37/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0145 - val_loss: 0.0140
Epoch 38/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0143 - val_loss: 0.0137
Epoch 39/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0140 - val_loss: 0.0135
Epoch 40/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0138 - val_loss: 0.0132
Epoch 41/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0136 - val_loss: 0.0130
Epoch 42/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0134 - val_loss: 0.0128
Epoch 43/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0131 - val_loss: 0.0126
Epoch 44/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0129 - val_loss: 0.0124
Epoch 45/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0128 - val_loss: 0.0122
Epoch 46/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0126 - val_loss: 0.0121
Epoch 47/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0124 - val_loss: 0.0119
Epoch 48/50
1875/1875 [==============================] - 9s 5ms/step - loss: 0.0122 - val_loss: 0.0117
Epoch 49/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0121 - val_loss: 0.0116
Epoch 50/50
1875/1875 [==============================] - 8s 4ms/step - loss: 0.0119 - val_loss: 0.0114